# Каждому нужен отдых! Предлагаем сделать паузу от решения задач... И сделать что-то действительно интересное.
# Напишите программу, которая N раз выводит строку «Купи слона!».

# Решение
slon = 'Купи слона!\n'
n = int(input())
print(n * slon, end='')