# Что же, время вернуться к работе. Предлагаем теперь разобраться, как работать с пропорциями и производить расчёты на основе заданных условий.

# А для этого возьмём действительно серьезную задачу... В детском саду 2 ребенка вместе съедают 2 куска колбасы за 2 минуты. 
# Напишите программу, которая вычисляет, сколько кусков колбасы съедят
# N детей за M минут.

# Решение
a = int(input())
b = int(input())
n = a * b // 2
print(n)